[
  {
    "id": "b1",
    "title": "Slash Your Electricity Bill: The Vampire Power Myth",
    "category": "Energy",
    "author": "Sarah Jenkins",
    "date": "Jan 15, 2026",
    "imageUrl": "assets/images/energy.png",
    "summary": "Are you paying for electricity you aren't even using? It sounds like a conspiracy theory, but for most Australian households, 'Vampire Power' is a real financial drain.",
    "content": "Are you paying for electricity you aren't even using? It sounds like a conspiracy theory, but for most Australian households, 'Vampire Power' (also known as standby power) is a very real drain on your finances.\n\nVampire power refers to the electricity consumed by appliances when they are switched off or in standby mode. While a single television in standby might only cost a few dollars a year, the cumulative effect of a modern home is staggering. Game consoles, microwaves, smart speakers, washing machines, and even your phone charger are constantly sipping energy.\n\nRecent studies suggest that standby power can account for up to 10% of a household's total electricity usage. If your quarterly bill is $500, that is $200 a year wasted on appliances doing absolutely nothing.\n\nSo, how do you stop it?\n\n1. The Smart Power Board: This is your best weapon. These boards detect when your main device (like a TV) is turned off and automatically cut power to the peripherals (soundbar, game console, subwoofer).\n\n2. The 'Off' Habit: It sounds simple, but switching off the microwave and washing machine at the wall can save $20-$30 a year alone.\n\n3. Audit Your Old Tech: That old plasma TV in the spare room or the beer fridge in the garage? They are energy guzzlers. If you aren't using them daily, unplug them.\n\nBy attacking vampire power, you are essentially giving yourself a 10% discount on electricity before you even compare providers. Combine this with a better market rate from SaveNest, and your savings will skyrocket."
  },
  {
    "id": "b2",
    "title": "Is Your NBN Plan Too Fast? The Speed Trap",
    "category": "Internet",
    "author": "Mike Chen",
    "date": "Jan 12, 2026",
    "imageUrl": "assets/images/internet.png",
    "summary": "We all want the fastest internet possible, but are you paying a premium for speed you literally cannot use?",
    "content": "We all want the fastest internet possible, but are you paying a premium for speed you literally cannot use? Many Australians are subscribed to NBN 100 (Fast) or NBN 250 (Superfast) plans, assuming they need it for streaming and working from home. The reality is often quite different.\n\nLet's look at the numbers. Streaming a movie in 4K Ultra HD on Netflix requires a stable connection of about 25 Mbps. A high-quality Zoom call requires roughly 3-4 Mbps. Even online gaming relies more on latency (ping) than raw download speed.\n\nThis means that a standard NBN 50 plan is more than enough to handle two people streaming 4K content while a third person is on a video call—simultaneously.\n\nIf you are a household of two or three people paying $110/month for an NBN 100 plan, you are likely wasting $20 to $30 every month. That is over $300 a year spent on 'headroom' that your devices never utilize.\n\nThe Speed Trap:\nISPs love to upsell you on speed tiers because it is pure profit for them. They market 'Gigabit speed' as a necessity for the modern home. But unless you are regularly downloading massive files (like 100GB video games or 4K video editing projects), that gigabit speed sits idle 99% of the time.\n\nThe Solution:\nTry downgrading. Switch to a high-quality NBN 50 plan for a month. If you don't notice a difference (and you likely won't), you have just pocketed an easy $300 a year. If you do notice a slowdown, you can upgrade back instantly."
  },
  {
    "id": "b3",
    "title": "Prepaid vs Postpaid: The Mobile Data Trap",
    "category": "Mobile",
    "author": "Emma Wilson",
    "date": "Jan 10, 2026",
    "imageUrl": "assets/images/mobile.png",
    "summary": "For years, the standard way to own a mobile phone was the 24-month contract. But as hardware improvements plateau, the contract model has become a financial trap.",
    "content": "For years, the standard way to own a mobile phone in Australia was the 24-month contract. You got a 'free' phone, a set amount of data, and a hefty monthly bill. But as phone hardware improvements plateau and SIM-only plans become aggressive, the contract model has become a financial trap.\n\nThe 'Loyalty Tax' in the mobile market is severe. Major telcos bank on you setting up a direct debit and forgetting about it. Meanwhile, smaller providers (MVNOs) who rent the exact same network towers are offering double the data for half the price.\n\nHere is the math:\nA typical major telco postpaid plan might be $69/month for 80GB of data. Over a year, that is $828.\nA competitor using the same network might offer a '365-day Long Expiry' prepaid plan: 140GB for $200.\n\nBy switching to the prepaid annual model, you save $628 a year. Even if you need to buy a brand new mid-range phone outright for $500, you are still ahead financially after just one year.\n\nWhy Prepaid Wins:\n1. No Bill Shock: You cannot accidentally spend $500 on excess data or premium calls. When your credit is done, it's done.\n2. Data Banking: Many prepaid plans let you keep unused data indefinitely.\n3. Flexibility: You are never locked in. If a better deal pops up next month, you can switch instantly.\n\nStop renting your usage. Own your plan and pocket the difference."
  },
  {
    "id": "b4",
    "title": "Home Insurance: The 'Set and Forget' Mistake",
    "category": "Insurance",
    "author": "David Ross",
    "date": "Jan 05, 2026",
    "imageUrl": "assets/images/home_ins.png",
    "summary": "Home and Contents insurance is the classic 'grudge purchase.' We buy it because we have to, but this 'set and forget' mentality is leaving thousands underinsured.",
    "content": "Home and Contents insurance is the classic 'grudge purchase.' We buy it because we have to, and we rarely look at it again until something goes wrong or the renewal notice arrives. But this 'set and forget' mentality is leaving thousands of Australians underinsured and overcharged.\n\nThe Inflation Problem:\nBuilding costs in Australia have skyrocketed by over 20% in the last few years. If you set your 'Sum Insured' (the amount you are covered for) back in 2021 and haven't updated it, you are likely underinsured. If your home burns down today, your payout might only cover 80% of the rebuild cost, leaving you hundreds of thousands of dollars out of pocket.\n\nThe Lazy Tax:\nInsurers rely on inertia. They know that 80% of customers will simply auto-renew even if the premium jumps by 15%. They reserve their best 'new customer' rates for people who switch.\n\nThe Strategy:\n1. Review your Sum Insured immediately using an online calculator. Ensure it reflects 2026 building prices.\n2. Get three quotes. It takes less than 10 minutes on SaveNest to compare policies.\n3. Call your current insurer. Before you switch, give them a chance. Say, 'I have a quote for the same cover that is $300 cheaper. Can you match it?'\n4. If they say no, switch. Loyalty in insurance does not pay; it costs."
  },
  {
    "id": "b5",
    "title": "Car Insurance Loyalty Tax: Switch Every Year",
    "category": "Car Insurance",
    "author": "Sarah Jenkins",
    "date": "Jan 02, 2026",
    "imageUrl": "assets/images/car_ins.png",
    "summary": "Car insurance is perhaps the most volatile expense in the household budget. Unlike registration, your premium is calculated by an algorithm testing your willingness to pay.",
    "content": "Car insurance is perhaps the most volatile expense in the household budget. Unlike your car registration which is a fixed fee, your insurance premium is calculated by an algorithm that tries to guess how much you are willing to pay.\n\nThe 'New Customer' Bonus:\nInsurers spend millions on advertising to acquire new customers. To get you in the door, they often offer an artificially low premium for the first year. They might even make a loss on you initially.\n\nThe 'Renewal' Hike:\nOnce you are a customer, the algorithm changes. It knows you are already signed up. Next year, your renewal notice arrives, and the price has jumped by $200. Have you become a worse driver? No. The insurer is simply testing your price elasticity. They are betting you are too busy to switch.\n\nHow to Win:\nYou must treat car insurance as a 12-month product. Never auto-renew without checking the market.\n1. Set a calendar reminder for 25 days before your policy expires.\n2. Run a comparison. You will almost certainly find a 'new customer' offer from a competitor that beats your renewal price.\n3. Switch.\n\nBy switching every year, you effectively surf the 'new customer' bonuses of different insurers, ensuring you never pay the loyalty tax. It is the single highest 'hourly wage' task you can do—saving $500 for 15 minutes of work."
  }
]